#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция Описание() Экспорт
	
	структураВозврата = Новый Структура();
	структураВозврата.Вставить("Реквизиты",		описаниеРеквизитов());
	структураВозврата.Вставить("ТабличныеЧасти",описаниеТабличныхЧастей());
	
	Возврат структураВозврата;
	
КонецФункции //Описание

Функция описаниеРеквизитов()
	
	описаниеРеквизитов = Новый Структура();
	описаниеРеквизитов.Вставить("Артикул", "");
	Возврат описаниеРеквизитов;
	
КонецФункции //описаниеРеквизитов
 
Функция описаниеТабличныхЧастей()
	
	описаниеТабличныхЧастей = Новый Структура();
	Возврат описаниеТабличныхЧастей;
	
КонецФункции //описаниеТабличныхЧастей
 

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#КонецЕсли