#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИнициализацияОбъектовМетаданных()
	
	СписокОбъектов = Новый СписокЗначений();
	// _Демо начало примера
	СписокОбъектов.Добавить(Метаданные.Справочники._ДемоНоменклатура.ПолноеИмя(),Метаданные.Справочники._ДемоНоменклатура.Представление());
	// _Демо конец примера

	
КонецФункции //ИнициализацияОбъектовМетаданных


#КонецОбласти

#Область КонструкторОбъекта

ОбъектыМетаданных =  ИнициализацияОбъектовМетаданных();

#КонецОбласти 

#КонецЕсли


