#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИнициализацияОбъектовМетаданных()
	
	СписокОбъектов = Новый СписокЗначений();
	// _Демо начало примера
	СписокОбъектов.Добавить(Метаданные.Справочники._ДемоНоменклатура.ПолноеИмя(),Метаданные.Справочники._ДемоНоменклатура.Представление(),,БиблиотекаКартинок.Справочник);
	СписокОбъектов.Добавить(Метаданные.Справочники._ДемоСклады.ПолноеИмя(),Метаданные.Справочники._ДемоСклады.Представление(),,БиблиотекаКартинок.Справочник);
	СписокОбъектов.Добавить(Метаданные.Справочники._ДемоПартнеры.ПолноеИмя(),Метаданные.Справочники._ДемоПартнеры.Представление(),,БиблиотекаКартинок.Справочник);
	СписокОбъектов.Добавить(Метаданные.Документы._ДемоЗаказыПокупателя.ПолноеИмя(),Метаданные.Документы._ДемоЗаказыПокупателя.Представление(),,БиблиотекаКартинок.Документ);
	// _Демо конец примера
	
	Возврат СписокОбъектов;
	
КонецФункции //ИнициализацияОбъектовМетаданных


#КонецОбласти

#Область КонструкторОбъекта

// инициализация объекта по умолчанию
ОбъектыМетаданных =  ИнициализацияОбъектовМетаданных();

#КонецОбласти 

#КонецЕсли


